mostangrymike/ovms-agent/SRC/M289_BUILD_PROFILE.C
#include <ctype.h>
#include <stdio.h>
#include <string.h>

#include "M289_BUILD_PROFILE.H"

#define M289_LINE_MAX 1024U

#define M289_KEY_LANGUAGE   0x0001UL
#define M289_KEY_EXTENSIONS 0x0002UL
#define M289_KEY_KIND       0x0004UL
#define M289_KEY_COMPILE    0x0008UL
#define M289_KEY_COPTS      0x0010UL
#define M289_KEY_LINK       0x0020UL
#define M289_KEY_LOPTS      0x0040UL
#define M289_KEY_OBJEXT     0x0080UL
#define M289_KEY_EXEEXT     0x0100UL
#define M289_KEY_RUN        0x0200UL

#define M289_KEYS_COMMON       0x0007UL
#define M289_KEYS_COMPILED     0x01ffUL
#define M289_KEYS_COMPILED_ONLY 0x001fUL
#define M289_KEYS_INTERPRETED  (M289_KEYS_COMMON | M289_KEY_RUN)
#define M289_KEYS_LINK_OUTPUT  (M289_KEY_LINK | M289_KEY_LOPTS | \
                                M289_KEY_OBJEXT | M289_KEY_EXEEXT)
#define M289_KEYS_INTERP_BAD   (M289_KEY_COMPILE | M289_KEY_COPTS | \
                                M289_KEYS_LINK_OUTPUT)
#define M289_KEYS_COMPILE_ONLY_BAD (M289_KEY_RUN | M289_KEYS_LINK_OUTPUT)

#define M289_TEMPLATE_COMPILED 0
#define M289_TEMPLATE_RUN 1
#define M289_TEMPLATE_COMPILE_ONLY 2

static void m289_error(char *error, size_t error_size, const char *text)
{
    if (error == NULL || error_size == 0U) {
        return;
    }
    if (text == NULL) {
        text = "Unknown build-profile error.";
    }
    (void)strncpy(error, text, error_size - 1U);
    error[error_size - 1U] = '\0';
}

static int m289_equal_ci(const char *left, const char *right)
{
    unsigned char a;
    unsigned char b;

    if (left == NULL || right == NULL) {
        return 0;
    }

    while (*left != '\0' && *right != '\0') {
        a = (unsigned char)toupper((unsigned char)*left++);
        b = (unsigned char)toupper((unsigned char)*right++);
        if (a != b) {
            return 0;
        }
    }
    return *left == '\0' && *right == '\0';
}

static char *m289_ltrim(char *text)
{
    if (text == NULL) {
        return NULL;
    }
    while (*text == ' ' || *text == '\t') {
        ++text;
    }
    return text;
}

static void m289_rtrim(char *text)
{
    size_t length;

    if (text == NULL) {
        return;
    }
    length = strlen(text);
    while (length > 0U &&
           (text[length - 1U] == ' ' || text[length - 1U] == '\t' ||
            text[length - 1U] == '\r' || text[length - 1U] == '\n')) {
        text[--length] = '\0';
    }
}

static int m289_copy(char *target, size_t target_size, const char *value)
{
    size_t length;

    if (target == NULL || target_size == 0U || value == NULL) {
        return 0;
    }
    length = strlen(value);
    if (length >= target_size) {
        return 0;
    }
    (void)memcpy(target, value, length + 1U);
    return 1;
}

static int m289_key_store(m289_build_profile *profile,
                          const char *key,
                          const char *value,
                          unsigned long *seen,
                          char *error,
                          size_t error_size)
{
    unsigned long bit;
    char *target;
    size_t target_size;

    bit = 0UL;
    target = NULL;
    target_size = 0U;

    if (strcmp(key, "language") == 0) {
        bit = M289_KEY_LANGUAGE;
        target = profile->language;
        target_size = sizeof(profile->language);
    } else if (strcmp(key, "extensions") == 0) {
        bit = M289_KEY_EXTENSIONS;
        target = profile->extensions;
        target_size = sizeof(profile->extensions);
    } else if (strcmp(key, "kind") == 0) {
        bit = M289_KEY_KIND;
        target = profile->kind;
        target_size = sizeof(profile->kind);
    } else if (strcmp(key, "run_command") == 0) {
        bit = M289_KEY_RUN;
        target = profile->run_command;
        target_size = sizeof(profile->run_command);
    } else if (strcmp(key, "compile_command") == 0) {
        bit = M289_KEY_COMPILE;
        target = profile->compile_command;
        target_size = sizeof(profile->compile_command);
    } else if (strcmp(key, "compile_options") == 0) {
        bit = M289_KEY_COPTS;
        target = profile->compile_options;
        target_size = sizeof(profile->compile_options);
    } else if (strcmp(key, "link_command") == 0) {
        bit = M289_KEY_LINK;
        target = profile->link_command;
        target_size = sizeof(profile->link_command);
    } else if (strcmp(key, "link_options") == 0) {
        bit = M289_KEY_LOPTS;
        target = profile->link_options;
        target_size = sizeof(profile->link_options);
    } else if (strcmp(key, "object_extension") == 0) {
        bit = M289_KEY_OBJEXT;
        target = profile->object_extension;
        target_size = sizeof(profile->object_extension);
    } else if (strcmp(key, "executable_extension") == 0) {
        bit = M289_KEY_EXEEXT;
        target = profile->executable_extension;
        target_size = sizeof(profile->executable_extension);
    } else {
        m289_error(error, error_size, "Unknown build-profile key.");
        return 0;
    }

    if ((*seen & bit) != 0UL) {
        m289_error(error, error_size, "Duplicate build-profile key.");
        return 0;
    }
    if (!m289_copy(target, target_size, value)) {
        m289_error(error, error_size, "Build-profile value is too long.");
        return 0;
    }

    *seen |= bit;
    return 1;
}

static int m289_placeholder_ok(const char *name)
{
    return strcmp(name, "source") == 0 ||
           strcmp(name, "source_name") == 0 ||
           strcmp(name, "object") == 0 ||
           strcmp(name, "executable") == 0 ||
           strcmp(name, "compile_options") == 0 ||
           strcmp(name, "link_options") == 0;
}

static int m289_run_placeholder_ok(const char *name)
{
    return strcmp(name, "source") == 0 ||
           strcmp(name, "source_name") == 0;
}

static int m289_compile_only_placeholder_ok(const char *name)
{
    return strcmp(name, "source") == 0 ||
           strcmp(name, "source_name") == 0 ||
           strcmp(name, "compile_options") == 0;
}

static int m289_template_ok(const char *text, int template_kind)
{
    const char *open;
    const char *close;
    char name[64];
    size_t length;
    int valid;

