mostangrymike/ovms-agent/SRC/M289_BUILD_PROFILE.C
    if (text == NULL || *text == '\0') {
        return 0;
    }

    open = text;
    while (*open != '\0') {
        if (*open == '}') {
            return 0;
        }
        if (*open != '{') {
            ++open;
            continue;
        }
        close = strchr(open + 1, '}');
        if (close == NULL) {
            return 0;
        }
        length = (size_t)(close - (open + 1));
        if (length == 0U || length >= sizeof(name)) {
            return 0;
        }
        (void)memcpy(name, open + 1, length);
        name[length] = '\0';
        if (template_kind == M289_TEMPLATE_RUN) {
            valid = m289_run_placeholder_ok(name);
        } else if (template_kind == M289_TEMPLATE_COMPILE_ONLY) {
            valid = m289_compile_only_placeholder_ok(name);
        } else {
            valid = m289_placeholder_ok(name);
        }
        if (!valid) {
            return 0;
        }
        open = close + 1;
    }
    return 1;
}

int m289_profile_load(const char *path,
                      m289_build_profile *profile,
                      char *error,
                      size_t error_size)
{
    FILE *file;
    char line[M289_LINE_MAX];
    char *text;
    char *equals;
    char *key;
    char *value;
    size_t length;
    unsigned long seen;
    int ok;

    if (error != NULL && error_size > 0U) {
        error[0] = '\0';
    }
    if (path == NULL || profile == NULL) {
        m289_error(error, error_size, "Invalid build-profile arguments.");
        return 0;
    }

    (void)memset(profile, 0, sizeof(*profile));
    file = fopen(path, "r");
    if (file == NULL) {
        m289_error(error, error_size, "Unable to open build profile.");
        return 0;
    }

    seen = 0UL;
    ok = 1;
    while (ok && fgets(line, sizeof(line), file) != NULL) {
        length = strlen(line);
        if (length > 0U && line[length - 1U] != '\n' && !feof(file)) {
            m289_error(error, error_size, "Build-profile line is too long.");
            ok = 0;
            break;
        }

        m289_rtrim(line);
        text = m289_ltrim(line);
        if (*text == '\0' || *text == '#') {
            continue;
        }

        equals = strchr(text, '=');
        if (equals == NULL || equals == text) {
            m289_error(error, error_size, "Malformed build-profile line.");
            ok = 0;
            break;
        }
        *equals = '\0';
        key = m289_ltrim(text);
        m289_rtrim(key);
        value = m289_ltrim(equals + 1);
        m289_rtrim(value);

        if (*key == '\0' || !m289_key_store(profile, key, value,
                                             &seen, error, error_size)) {
            ok = 0;
            break;
        }
    }

    if (ferror(file)) {
        m289_error(error, error_size, "Unable to read build profile.");
        ok = 0;
    }
    if (fclose(file) != 0) {
        m289_error(error, error_size, "Unable to close build profile.");
        ok = 0;
    }
    if (!ok) {
        return 0;
    }

    if (m289_equal_ci(profile->kind, "compiled")) {
        if ((seen & M289_KEYS_COMPILED) != M289_KEYS_COMPILED) {
            m289_error(error, error_size, "Missing required build-profile key.");
            return 0;
        }
        if ((seen & M289_KEY_RUN) != 0UL) {
            m289_error(error, error_size,
                       "Build-profile key is not allowed for this kind.");
            return 0;
        }
        if (profile->language[0] == '\0' || profile->extensions[0] == '\0' ||
            profile->compile_command[0] == '\0' ||
            profile->link_command[0] == '\0' ||
            profile->object_extension[0] == '\0' ||
            profile->executable_extension[0] == '\0') {
            m289_error(error, error_size,
                       "Required build-profile value is empty.");
            return 0;
        }
        if (!m289_template_ok(profile->compile_command,
                              M289_TEMPLATE_COMPILED) ||
            !m289_template_ok(profile->link_command,
                              M289_TEMPLATE_COMPILED)) {
            m289_error(error, error_size,
                       "Invalid build-profile placeholder.");
            return 0;
        }
        return 1;
    }

    if (m289_equal_ci(profile->kind, "compile_only")) {
        if ((seen & M289_KEYS_COMPILED_ONLY) != M289_KEYS_COMPILED_ONLY) {
            m289_error(error, error_size, "Missing required build-profile key.");
            return 0;
        }
        if ((seen & M289_KEYS_COMPILE_ONLY_BAD) != 0UL) {
            m289_error(error, error_size,
                       "Build-profile key is not allowed for this kind.");
            return 0;
        }
        if (profile->language[0] == '\0' || profile->extensions[0] == '\0' ||
            profile->compile_command[0] == '\0') {
            m289_error(error, error_size,
                       "Required build-profile value is empty.");
            return 0;
        }
        if (!m289_template_ok(profile->compile_command,
                              M289_TEMPLATE_COMPILE_ONLY)) {
            m289_error(error, error_size,
                       "Invalid build-profile placeholder.");
            return 0;
        }
        return 1;
    }

    if (m289_equal_ci(profile->kind, "interpreted") ||
        m289_equal_ci(profile->kind, "procedure")) {
        if ((seen & M289_KEYS_INTERPRETED) != M289_KEYS_INTERPRETED) {
            m289_error(error, error_size, "Missing required build-profile key.");
            return 0;
        }
        if ((seen & M289_KEYS_INTERP_BAD) != 0UL) {
            m289_error(error, error_size,
                       "Build-profile key is not allowed for this kind.");
            return 0;
        }
        if (profile->language[0] == '\0' || profile->extensions[0] == '\0' ||
            profile->run_command[0] == '\0') {
            m289_error(error, error_size,
                       "Required build-profile value is empty.");
            return 0;
        }
        if (!m289_template_ok(profile->run_command, M289_TEMPLATE_RUN)) {
            m289_error(error, error_size,
                       "Invalid build-profile placeholder.");
            return 0;
        }
        return 1;
    }

