mostangrymike/ovms-agent/SRC/M289_BUILD_PROFILE.C
    m289_error(error, error_size, "Unsupported build-profile kind.");
    return 0;
}

static int m289_suffix_ci(const char *text, const char *suffix)
{
    size_t text_length;
    size_t suffix_length;
    size_t index;
    unsigned char a;
    unsigned char b;

    text_length = strlen(text);
    suffix_length = strlen(suffix);
    if (suffix_length == 0U || suffix_length > text_length) {
        return 0;
    }
    text += text_length - suffix_length;
    for (index = 0U; index < suffix_length; ++index) {
        a = (unsigned char)toupper((unsigned char)text[index]);
        b = (unsigned char)toupper((unsigned char)suffix[index]);
        if (a != b) {
            return 0;
        }
    }
    return 1;
}

static int m289_source_allowed(const m289_build_profile *profile,
                               const char *source)
{
    char work[M289_PROFILE_EXTS_MAX];
    char *token;
    char *next;

    if (!m289_copy(work, sizeof(work), profile->extensions)) {
        return 0;
    }

    token = work;
    while (*token != '\0') {
        while (*token == ' ' || *token == '\t' || *token == ',') {
            ++token;
        }
        if (*token == '\0') {
            break;
        }
        next = token;
        while (*next != '\0' && *next != ',') {
            ++next;
        }
        if (*next != '\0') {
            *next++ = '\0';
        }
        m289_rtrim(token);
        if (*token != '\0' && m289_suffix_ci(source, token)) {
            return 1;
        }
        token = next;
    }
    return 0;
}

static const char *m289_last_component(const char *path)
{
    const char *scan;
    const char *base;

    base = path;
    for (scan = path; *scan != '\0'; ++scan) {
        if (*scan == '/' || *scan == '\\' || *scan == ']' ||
            *scan == '>' || *scan == ':') {
            base = scan + 1;
        }
    }
    return base;
}

static int m289_source_name(const char *source,
                            char *source_name,
                            size_t source_name_size)
{
    const char *base;
    const char *dot;
    const char *scan;
    size_t length;

    base = m289_last_component(source);
    dot = NULL;
    for (scan = base; *scan != '\0'; ++scan) {
        if (*scan == '.') {
            dot = scan;
        }
    }
    if (dot == NULL || dot == base) {
        return 0;
    }
    length = (size_t)(dot - base);
    if (length + 1U > source_name_size) {
        return 0;
    }
    (void)memcpy(source_name, base, length);
    source_name[length] = '\0';
    return 1;
}

static int m289_derive_names(const char *source,
                             const char *object_extension,
                             const char *executable_extension,
                             char *source_name,
                             size_t source_name_size,
                             char *object,
                             size_t object_size,
                             char *executable,
                             size_t executable_size)
{
    const char *base;
    const char *dot;
    const char *scan;
    size_t stem_length;
    size_t base_stem_length;

    base = m289_last_component(source);
    dot = NULL;
    for (scan = base; *scan != '\0'; ++scan) {
        if (*scan == '.') {
            dot = scan;
        }
    }
    if (dot == NULL || dot == base) {
        return 0;
    }

    stem_length = (size_t)(dot - source);
    base_stem_length = (size_t)(dot - base);
    if (base_stem_length + 1U > source_name_size ||
        stem_length + strlen(object_extension) + 1U > object_size ||
        stem_length + strlen(executable_extension) + 1U > executable_size) {
        return 0;
    }

    (void)memcpy(source_name, base, base_stem_length);
    source_name[base_stem_length] = '\0';
    (void)memcpy(object, source, stem_length);
    object[stem_length] = '\0';
    (void)strcat(object, object_extension);
    (void)memcpy(executable, source, stem_length);
    executable[stem_length] = '\0';
    (void)strcat(executable, executable_extension);
    return 1;
}

static int m289_append(char *output,
                       size_t output_size,
                       size_t *used,
                       const char *text,
                       size_t length)
{
    if (*used + length >= output_size) {
        return 0;
    }
    if (length > 0U) {
        (void)memcpy(output + *used, text, length);
        *used += length;
    }
    output[*used] = '\0';
    return 1;
}

static void m289_compact_spaces(char *text)
{
    char *readp;
    char *writep;
    int quoted;
    int pending_space;

    readp = text;
    writep = text;
    quoted = 0;
    pending_space = 0;

    while (*readp != '\0') {
        if (*readp == '"') {
            if (pending_space && writep != text) {
                *writep++ = ' ';
            }
            pending_space = 0;
            *writep++ = *readp++;
            quoted = !quoted;
            continue;
        }
        if (!quoted && (*readp == ' ' || *readp == '\t')) {
            pending_space = 1;
            ++readp;
            continue;
        }
        if (pending_space && writep != text) {
            *writep++ = ' ';
        }
        pending_space = 0;
        *writep++ = *readp++;
    }
    *writep = '\0';
}

static const char *m289_replacement(const char *name,
                                    const char *source,
                                    const char *source_name,
                                    const char *object,
                                    const char *executable,
                                    const m289_build_profile *profile)
{
    if (strcmp(name, "source") == 0) return source;
    if (strcmp(name, "source_name") == 0) return source_name;
    if (strcmp(name, "object") == 0) return object;
    if (strcmp(name, "executable") == 0) return executable;
    if (strcmp(name, "compile_options") == 0) return profile->compile_options;
    if (strcmp(name, "link_options") == 0) return profile->link_options;
    return NULL;
}

static int m289_expand(const char *template_text,
                       const char *source,
                       const char *source_name,
                       const char *object,
                       const char *executable,
                       const m289_build_profile *profile,
                       char *output,
                       size_t output_size)
{
    const char *scan;
    const char *close;
    const char *replacement;
    char name[64];
    size_t used;
    size_t length;

    if (output == NULL || output_size == 0U) {
        return 0;
    }
    output[0] = '\0';
    used = 0U;
    scan = template_text;

