mostangrymike/ovms-agent/SRC/M289_BUILD_PROFILE.C
    while (*scan != '\0') {
        if (*scan != '{') {
            if (!m289_append(output, output_size, &used, scan, 1U)) {
                return 0;
            }
            ++scan;
            continue;
        }
        close = strchr(scan + 1, '}');
        if (close == NULL) {
            return 0;
        }
        length = (size_t)(close - (scan + 1));
        if (length == 0U || length >= sizeof(name)) {
            return 0;
        }
        (void)memcpy(name, scan + 1, length);
        name[length] = '\0';
        replacement = m289_replacement(name, source, source_name,
                                       object, executable, profile);
        if (replacement == NULL ||
            !m289_append(output, output_size, &used,
                         replacement, strlen(replacement))) {
            return 0;
        }
        scan = close + 1;
    }

    m289_compact_spaces(output);
    return output[0] != '\0';
}

int m289_profile_commands(const m289_build_profile *profile,
                          const char *source,
                          char *compile_command,
                          size_t compile_size,
                          char *link_command,
                          size_t link_size,
                          char *error,
                          size_t error_size)
{
    char source_name[M289_PROFILE_PATH_MAX];
    char object[M289_PROFILE_PATH_MAX];
    char executable[M289_PROFILE_PATH_MAX];

    if (error != NULL && error_size > 0U) {
        error[0] = '\0';
    }
    if (profile == NULL || source == NULL || *source == '\0' ||
        compile_command == NULL || link_command == NULL) {
        m289_error(error, error_size, "Invalid command-resolution arguments.");
        return 0;
    }
    if (!m289_equal_ci(profile->kind, "compiled")) {
        m289_error(error, error_size, "Profile is not a compiled toolchain.");
        return 0;
    }
    if (!m289_source_allowed(profile, source)) {
        m289_error(error, error_size,
                   "Source extension is not allowed by profile.");
        return 0;
    }
    if (!m289_derive_names(source,
                           profile->object_extension,
                           profile->executable_extension,
                           source_name, sizeof(source_name),
                           object, sizeof(object),
                           executable, sizeof(executable))) {
        m289_error(error, error_size, "Unable to derive build output names.");
        return 0;
    }
    if (!m289_expand(profile->compile_command, source, source_name,
                     object, executable, profile,
                     compile_command, compile_size) ||
        !m289_expand(profile->link_command, source, source_name,
                     object, executable, profile,
                     link_command, link_size)) {
        m289_error(error, error_size, "Resolved build command is too long.");
        return 0;
    }
    return 1;
}

int m289_profile_compile_command(const m289_build_profile *profile,
                                 const char *source,
                                 char *compile_command,
                                 size_t compile_size,
                                 char *error,
                                 size_t error_size)
{
    char source_name[M289_PROFILE_PATH_MAX];

    if (error != NULL && error_size > 0U) {
        error[0] = '\0';
    }
    if (profile == NULL || source == NULL || *source == '\0' ||
        compile_command == NULL || compile_size == 0U) {
        m289_error(error, error_size, "Invalid command-resolution arguments.");
        return 0;
    }
    if (!m289_equal_ci(profile->kind, "compile_only")) {
        m289_error(error, error_size, "Profile is not a compile-only toolchain.");
        return 0;
    }
    if (!m289_source_allowed(profile, source)) {
        m289_error(error, error_size,
                   "Source extension is not allowed by profile.");
        return 0;
    }
    if (!m289_source_name(source, source_name, sizeof(source_name))) {
        m289_error(error, error_size, "Unable to derive source name.");
        return 0;
    }
    if (!m289_expand(profile->compile_command, source, source_name,
                     "", "", profile, compile_command, compile_size)) {
        m289_error(error, error_size, "Resolved compile command is too long.");
        return 0;
    }
    return 1;
}

int m289_profile_run_command(const m289_build_profile *profile,
                             const char *source,
                             char *run_command,
                             size_t run_size,
                             char *error,
                             size_t error_size)
{
    char source_name[M289_PROFILE_PATH_MAX];

    if (error != NULL && error_size > 0U) {
        error[0] = '\0';
    }
    if (profile == NULL || source == NULL || *source == '\0' ||
        run_command == NULL || run_size == 0U) {
        m289_error(error, error_size, "Invalid command-resolution arguments.");
        return 0;
    }
    if (!m289_equal_ci(profile->kind, "interpreted") &&
        !m289_equal_ci(profile->kind, "procedure")) {
        m289_error(error, error_size,
                   "Profile is not an interpreted/procedure toolchain.");
        return 0;
    }
    if (!m289_source_allowed(profile, source)) {
        m289_error(error, error_size,
                   "Source extension is not allowed by profile.");
        return 0;
    }
    if (!m289_source_name(source, source_name, sizeof(source_name))) {
        m289_error(error, error_size, "Unable to derive source name.");
        return 0;
    }
    if (!m289_expand(profile->run_command, source, source_name,
                     "", "", profile, run_command, run_size)) {
        m289_error(error, error_size, "Resolved run command is too long.");
        return 0;
    }
    return 1;
}
